Catalogs/ПодразделенияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ПодразделенияОрганизаций</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Hierarchical>true</Hierarchical>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКодПоОКАТО</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦифровойИндексОбособленногоПодразделения</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОрганаФСГС</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>pcru_ProcessCode</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БНФОСубконто</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/pcru_ex_ТипыЗатратПодразделений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>pcru_ex_ТипыЗатратПодразделений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БНФОСубконто</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ПодразделенияОрганизаций/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура pcru_ex_ПриОткрытииПосле(Отказ)
	Элементы.ГруппаНалоговыйОрган.Видимость = Истина;
КонецПроцедуры

&НаСервере
Процедура pcru_ex_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Элемент = pcru_РаботаСФормамиСервер.ДобавитьПолеВвода(ЭтаФорма, "pcru_ProcessCode", Элементы.PCRU_ДополнительныеРеквизиты, "Объект.pcru_ProcessCode");
	Элементы.Переместить(Элемент, Элементы.PCRU_ДополнительныеРеквизиты, Элемент);

КонецПроцедуры

&НаСервере
Процедура pcru_ex_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	
	НаборЗаписей = РегистрыСведений.pcru_ex_ТипыЗатратПодразделений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Подразделение.Установить(Объект.Ссылка);
	НаборЗаписей.Прочитать();
	Для Каждого Строка Из НаборЗаписей Цикл
		pcru_ТипЗатрат = Строка.ТипЗатрат;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура pcru_ex_pcru_ТипЗатратПриИзмененииПосле(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура pcru_ex_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	
	НаборЗаписей = РегистрыСведений.pcru_ex_ТипыЗатратПодразделений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Подразделение.Установить(Объект.Ссылка);
	
	Если ЗначениеЗаполнено(pcru_ТипЗатрат) Тогда
		НаборЗаписей.Прочитать();
		ЗаписыватьРегистр = Ложь;	
		Если НаборЗаписей.Количество() <> 0 Тогда
			Для Каждого Строка Из НаборЗаписей Цикл
				Если pcru_ТипЗатрат <> Строка.ТипЗатрат Тогда
					Строка.ТипЗатрат = pcru_ТипЗатрат;
					ЗаписыватьРегистр = Истина;
				КонецЕсли;
			КонецЦикла;
		Иначе
			стрНабора = НаборЗаписей.Добавить();
			стрНабора.Подразделение = Объект.Ссылка;
			стрНабора.ТипЗатрат = pcru_ТипЗатрат;
			ЗаписыватьРегистр = Истина;
		КонецЕсли;
	Иначе
		ЗаписыватьРегистр = Истина;
	КонецЕсли;
	
	Если ЗаписыватьРегистр Тогда
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры
